---
kind: property
id: P:Autodesk.Revit.DB.Visual.Concrete.ConcreteBrightmode
source: html/6da9c7da-4bb8-5507-be6a-3412a03a719c.htm
---
# Autodesk.Revit.DB.Visual.Concrete.ConcreteBrightmode Property

The property labeled "Weathering" from the "Concrete" schema.

## Syntax (C#)
```csharp
public static string ConcreteBrightmode { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteBrightmodeType".